//
//  Extras.swift
//  Assignment12
//
//  Created by Akaki Titberidze on 11.04.24.
//

import UIKit


enum ZodiacSign: String {
    case aries = "ვერძი"
    case taurus = "კურო"
    case gemini = "ტყუპები"
    case cancer = "კირჩხიბი"
    case leo = "ლომი"
    case virgo = "ქალწული"
    case libra = "სასწორი"
    case scorpio = "მორიელი"
    case sagittarius = "მშვილდოსანი"
    case capricorn = "თხის რქა"
    case aquarius = "მერწყული"
    case pisces = "თევზები"
}

class ZodiacSignInfo {
    var sign: ZodiacSign
    var polarSign: ZodiacSign
    var imageName: String = ""
    var polarImageName: String = ""
    var description: String = ""
    
    init(sign: ZodiacSign, polarSign: ZodiacSign, imageName: String, polarImageName: String, description: String) {
        self.sign = sign
        self.polarSign = polarSign
        self.imageName = imageName
        self.polarImageName = polarImageName
        self.description = description
    }
}


let zodiacs: [ZodiacSignInfo] = [
    ZodiacSignInfo(sign: .aries, polarSign: .libra, imageName: "aries", polarImageName: "libra", description: "დაბადებულია მოგებისთვის, ძალიან აქტიური და კომუნიკაბელურია. არის თავმოყვარე, თავდაჯერებული, უშიშარი. მას მართავს გრძნობები, ჯერ აკეთებს და მერე ფიქრობს. იმპულსურია. გრძნობები უბინდავენ გონებას. ვნებიანი და ეგოისტია. ვერ იტანს, როცა რამეს უკრძალავენ. მათში ყველაფერი დიდი დოზითაა. ასევე ავანტიურისტია. დაბადებულია მოგებისთვის, ძალიან აქტიური და კომუნიკაბელურია. არის თავმოყვარე, თავდაჯერებული, უშიშარი. მას მართავს გრძნობები, ჯერ აკეთებს და მერე ფიქრობს. იმპულსურია. გრძნობები უბინდავენ გონებას. ვნებიანი და ეგოისტია. ვერ იტანს, როცა რამეს უკრძალავენ. მათში ყველაფერი დიდი დოზითაა. ასევე ავანტიურისტია."),
    ZodiacSignInfo(sign: .taurus, polarSign: .scorpio, imageName: "taurus", polarImageName: "scorpio", description: "პრაქტიკული, რეალისტი, პრაგმატული, პესიმისტი, უყვართ და პატივს სცემენ სიმდიდრეს, მაგრამ ხემოჭერილები არიან, უფრთხილდებიან იმას, რაც აქვთ. იზიდავთ გართობა და სიამოვნება. უყვართ სახლი და ოჯახი. მესაკუთრეები და კარგი მშობლები არიან. ჯიუტები, ძლიერი სულის პატრონები და შრომისმოყვარეები არიან. არ აქვთ არასრულყოფილების კომპლექსი. სულის სიღრმეში თავი სამყაროს ღერძებად მიაჩნიათ. პრაქტიკული, რეალისტი, პრაგმატული, პესიმისტი, უყვართ და პატივს სცემენ სიმდიდრეს, მაგრამ ხემოჭერილები არიან, უფრთხილდებიან იმას, რაც აქვთ. იზიდავთ გართობა და სიამოვნება. უყვართ სახლი და ოჯახი. მესაკუთრეები და კარგი მშობლები არიან. ჯიუტები, ძლიერი სულის პატრონები და შრომისმოყვარეები არიან. არ აქვთ არასრულყოფილების კომპლექსი. სულის სიღრმეში თავი სამყაროს ღერძებად მიაჩნიათ."),
    ZodiacSignInfo(sign: .gemini, polarSign: .sagittarius, imageName: "gemini", polarImageName: "sagittarius", description: "ძალიან უყვართ ჭორების და ინფორმაციების შეგროვება. იციან ყველაფერი ყველაფერზე და მათ შეიძლება შეხვდეთ ყველგან. გონებამახვილი, ცოცხალი, კომუნიკაბელური, მჭერმეტყველი.. ეს ყველაფერი ტყუპებზეა ნათქვამი. მათთან არ მოიწყენ. მიისწრაფიან სრულყოფილებისკენ, რათა ყველას თავი მოაწონონ. ადვილად ეგუებიან ყველაფერს. აქვთ უამრავი იდეა... სჭირთ გაორება. ძალიან უყვართ ჭორების და ინფორმაციების შეგროვება. იციან ყველაფერი ყველაფერზე და მათ შეიძლება შეხვდეთ ყველგან. გონებამახვილი, ცოცხალი, კომუნიკაბელური, მჭერმეტყველი.. ეს ყველაფერი ტყუპებზეა ნათქვამი. მათთან არ მოიწყენ. მიისწრაფიან სრულყოფილებისკენ, რათა ყველას თავი მოაწონონ. ადვილად ეგუებიან ყველაფერს. აქვთ უამრავი იდეა... სჭირთ გაორება."),
    ZodiacSignInfo(sign: .cancer, polarSign: .capricorn, imageName: "cancer", polarImageName: "capricorn", description: "რომანტიკული, გულიანი, უყვართ ბავშვები, ცხოველებიც. აქვთ მაღალი პასუხისმგებლობის გრძნობა. არიან დაკომპლექსებულები, ძალიან ეჭვიანები, თავგანწირულები, სენტიმენტალურები და კონსერვატორები. მესაკუთრეები, მგრძნობიარეები. აქვთ მდიდარი ფანტაზია და კარგი ინტუიცია. რომანტიკული, გულიანი, უყვართ ბავშვები, ცხოველებიც. აქვთ მაღალი პასუხისმგებლობის გრძნობა. არიან დაკომპლექსებულები, ძალიან ეჭვიანები, თავგანწირულები, სენტიმენტალურები და კონსერვატორები. მესაკუთრეები, მგრძნობიარეები. აქვთ მდიდარი ფანტაზია და კარგი ინტუიცია."),
    ZodiacSignInfo(sign: .leo, polarSign: .aquarius, imageName: "leo", polarImageName: "aquarius", description: "მამაცი, შეუპოვარი და გულუხვი. ცნობისმოყვარე, გავლენიანი, ცეცხლოვანი, უყვარს მართვა, საკუთარ თავზე შეყვარებული, ეგოცენტრიკი, პრესტიჟი მათთვის ყველაფერია, მიმზიდველი, არტისტული, მაგნიტური, დაბადებულია ლიდერად, რომანტიკული, ქარიზმატული, უყვართ ყურადღების ცენტრში ყოფნა და ხშირად იმსახურებენ კიდეც. მამაცი, შეუპოვარი და გულუხვი. ცნობისმოყვარე, გავლენიანი, ცეცხლოვანი, უყვარს მართვა, საკუთარ თავზე შეყვარებული, ეგოცენტრიკი, პრესტიჟი მათთვის ყველაფერია, მიმზიდველი, არტისტული, მაგნიტური, დაბადებულია ლიდერად, რომანტიკული, ქარიზმატული, უყვართ ყურადღების ცენტრში ყოფნა და ხშირად იმსახურებენ კიდეც."),
    ZodiacSignInfo(sign: .virgo, polarSign: .pisces, imageName: "virgo", polarImageName: "pisces", description: "თავშეკავებული, პედანტური, ანალიტიკური გონება, კრიტიკოსი, ყურადღებას აქცევს წვრილმანებს, რაციონალური, გამოთვლილი და დაგეგმილი აქვს ყველაფერი. პრაქტიკოსი, მომთხოვნი, საღი გონების პატრონი. თავშეკავებული, პედანტური, ანალიტიკური გონება, კრიტიკოსი, ყურადღებას აქცევს წვრილმანებს, რაციონალური, გამოთვლილი და დაგეგმილი აქვს ყველაფერი. პრაქტიკოსი, მომთხოვნი, საღი გონების პატრონი."),
    ZodiacSignInfo(sign: .libra, polarSign: .aries, imageName: "libra", polarImageName: "aries", description: "გაუბედავი, ჰარმონიული, პაცეფისტი, დამთმობი, გაურბის კონფლიქტეპს, დიპლომატი, არ უყვარს მარტოობა, ხშირად სისულელეებს აკეთებს, იდეალისტი, რომანტიკოსი, მიმზიდველი, უყვარს ხელოვნება, ახასიათებს მოუთმენლობა. გაუბედავი, ჰარმონიული, პაცეფისტი, დამთმობი, გაურბის კონფლიქტეპს, დიპლომატი, არ უყვარს მარტოობა, ხშირად სისულელეებს აკეთებს, იდეალისტი, რომანტიკოსი, მიმზიდველი, უყვარს ხელოვნება, ახასიათებს მოუთმენლობა."),
    ZodiacSignInfo(sign: .scorpio, polarSign: .taurus, imageName: "scorpio", polarImageName: "taurus", description: "მიდრეკილია დაპყრობისკენ, მისი დევიზია 'ყველაფერი ან არაფერი', ვნებიანია, მოსწონს მისტიკა, არღვევს ტაბუებს, თავდაჯერებული და მესაკუთრეა. ჯიუტი, რისკიანი, ემოციური, მიმწოლი ხასიათისაა. მიდრეკილია დაპყრობისკენ, მისი დევიზია 'ყველაფერი ან არაფერი', ვნებიანია, მოსწონს მისტიკა, არღვევს ტაბუებს, თავდაჯერებული და მესაკუთრეა. ჯიუტი, რისკიანი, ემოციური, მიმწოლი ხასიათისაა."),
    ZodiacSignInfo(sign: .sagittarius, polarSign: .gemini, imageName: "sagittarius", polarImageName: "gemini", description: "პირდაპირი, სამართლიანი, აგრესიული ოპტიმისტი, უყვარს ძებნა და პოვნა, არ აქვს ზომიერების შეგრძნება, სულ მოძრაობს, ფარული სურვილი აქვს ფლობის, იმპულსურია. პირდაპირი, სამართლიანი, აგრესიული ოპტიმისტი, უყვარს ძებნა და პოვნა, არ აქვს ზომიერების შეგრძნება, სულ მოძრაობს, ფარული სურვილი აქვს ფლობის, იმპულსურია. პირდაპირი, სამართლიანი, აგრესიული ოპტიმისტი, უყვარს ძებნა და პოვნა, არ აქვს ზომიერების შეგრძნება, სულ მოძრაობს, ფარული სურვილი აქვს ფლობის, იმპულსურია."),
    ZodiacSignInfo(sign: .capricorn, polarSign: .cancer, imageName: "capricorn", polarImageName: "cancer", description: "ახასიათებს თავმოყვარეობა, სიმდიდრის სიყვარული, პრაგმატულობა, სიფრთხილე, ამბიციურობა, თავშეკავებულობა, დამოუკიდებლობა . მათთვის ძალიან მნიშვნელოვანია მატერიალური კეთილდღეობა და სტატუსი. არიან კარიერისტები და კონსერვატორები. ახასიათებს თავმოყვარეობა, სიმდიდრის სიყვარული, პრაგმატულობა, სიფრთხილე, ამბიციურობა, თავშეკავებულობა, დამოუკიდებლობა . მათთვის ძალიან მნიშვნელოვანია მატერიალური კეთილდღეობა და სტატუსი. არიან კარიერისტები და კონსერვატორები."),
    ZodiacSignInfo(sign: .aquarius, polarSign: .leo, imageName: "aquarius", polarImageName: "leo", description: "ორიგინალური, ალტრუისტი, იდეალისტი, იდეალური მებრძოლი, კომუნიკაბელური, თავისუფლების მოყვარული, ექსტრავაგანტული, უყვარს პუბლიკის შოკურ მდგომარეობამდე მიყვანა. არიან ინტელექტუალები, ვერ იტანენ რუტინულ ცხოვრებას. ორიგინალური, ალტრუისტი, იდეალისტი, იდეალური მებრძოლი, კომუნიკაბელური, თავისუფლების მოყვარული, ექსტრავაგანტული, უყვარს პუბლიკის შოკურ მდგომარეობამდე მიყვანა. არიან ინტელექტუალები, ვერ იტანენ რუტინულ ცხოვრებას."),
    ZodiacSignInfo(sign: .pisces, polarSign: .virgo, imageName: "pisces", polarImageName: "virgo", description: "მგრძნობიარე მეოცნებეები, მდიდარი ფანტაზია, მიმზიდველობა, შემოქმედებითი ხასიათი, არტისტიზმი, პასიურები, გაუბედავები, ფატალურები, რეფლექსურები, აქვთ კარგი ინტუიცია. მგრძნობიარე მეოცნებეები, მდიდარი ფანტაზია, მიმზიდველობა, შემოქმედებითი ხასიათი, არტისტიზმი, პასიურები, გაუბედავები, ფატალურები, რეფლექსურები, აქვთ კარგი ინტუიცია. მგრძნობიარე მეოცნებეები, მდიდარი ფანტაზია, მიმზიდველობა, შემოქმედებითი ხასიათი, არტისტიზმი, პასიურები, გაუბედავები, ფატალურები, რეფლექსურები, აქვთ კარგი ინტუიცია."),
]


extension UIButton {
    class func customizedButton(customColor: UIColor, text: String) -> UIButton {
        let button = UIButton ()
        button.layer.borderColor = customColor.cgColor
        button.layer.cornerRadius = 5
        button.backgroundColor = customColor
        button.setTitle(text, for: .normal)
        button.translatesAutoresizingMaskIntoConstraints = false
        button.heightAnchor.constraint(equalToConstant: 44).isActive = true
        
        return button
    }
}
