//
//  PostsData.swift
//  Assignment24
//
//  Created by Akaki Titberidze on 23.05.24.
//

import Foundation

let postsData = [
    Posts(factMain: "ალექსანდრე დიდი ცოცხლად დამარხეს", factSecondary: "ისტორიკოსების ცნობით, მხედართმთავარი ძველი წელთაღრიცხვით 323 წელს შეეწირა იშვიათ დაავადებას, რომელმაც ის ექვსი დღის განმავლობაში პროგრესირებადი პარალიზებით მოიცვა."),
    Posts(factMain: "კლეოპატრამ თავის ორ ძმაზე იქორწინა", factSecondary: "ძველი ეგვიპტის დედოფალმა, კლეოპატრამ, თავის ძმასა და თანამმართველზე — პტოლემე XIII-ზე იქორწინა, ძველი წელთაღრიცხვით, დაახლოებით, 51 წელს, როცა ის მხოლოდ 18 წლის იყო, პტოლემე კი — 10-ის."),
    Posts(factMain: "ყველაზე ხანგრძლივი წელიწადი", factSecondary: "ძველი წელთაღრიცხვით 46 წელი ყველაზე ხანგრძლივი წელიწადი იყო, რომელიც 445 დღეს გაგრძელდა. წელიწადმა იულიუს კეისრის ბრძანებით დამატებით ორივე თვე მოიცვა. რომის იმპერატორის ბრძანება მიზნად ახლადშემუშავებული იულიუსის კალენდრის წელიწადის სეზონთან გასწორებას ისახავდა."),
    Posts(factMain: "მწერალმა ტიტანიკის ჩაძირვა იწინასწარმეტყველა", factSecondary: "ტიტანის ჩაძირვა: ამაოება 1898 წელს გამოქვეყნებული მცირე ზომის თხზულებაა, რომელიც მორგან რობერტსონს ეკუთვნის."),
    Posts(factMain: "აინშტაინს ისრაელის პრეზიდენტობა შესთავაზეს", factSecondary: "ნობელიანტ ფიზიკოსს, ალბერტ აინშტაინს, რომელიც სამეცნიერო და ფართო საზოგადოებაში ფარდობითობის თეორიით გახდა ცნობილი, ისრაელის პირველმა პრეზიდენტმა, ხაიმ ვაიცმანმა, 1952 წელს ცოცხლებს შორის 'უდიადესი ებრაელი' უწოდა."),
    Posts(factMain: "რა დაუწუნა ბარბარემ ნიკის?", factSecondary: "ნიკის ამაზე ჯერ განცხადება არ გაუკეთებია, ფანები ელოდებიან რომ რომელიმე მალე სიჩუმეს გაფანტავს"),
    Posts(factMain: "რა ზომის ფეხი აქვს ვასოს?", factSecondary: "დეველოპერებმა განაცხადეს რომ თუ მას 42 და მეტი ზომა ფეხი აქვს მის მოსმენას აზრი არ აქვს და კომენტარის გარეშე დატოვებენ ლექციას"),
    Posts(factMain: "რა სიმაღლისაა ანჟელა ew?", factSecondary: "ანჟელა ew არის მეტრაოთხმოცი, რაც ნიშნავს რომ ის დაახლოებით ტეილორ Swift-ის სიმაღლისაა და დიდი ფეხი აქვს"),
    Posts(factMain: "რატომ გაებუტა ბარბარეს ჭეპეტე?", factSecondary: "ამჟამინდელი მონაცემებით ისინი 2 დღე არ ესაუბრებოდნენ ერთმანეთს და როგორც გაირკვა ანიგნორებს აიგნორებდნენ რაღაც იგნორში."),
    Posts(factMain: "MVC vs MVVM", factSecondary: "აი ეს MVC გასაგებია, მაგრამ MVVM ჩემამდე არ დადის რა, ამ სვიბთ იუაიში სად ვიყენებთ მაგას?"),
    Posts(factMain: "ნეტავ რამდენი ხანი გაგრძელდება ეს?", factSecondary: "აღმოჩნდა რომ დეველოპერები ძალიან გახარებულები არიან SwiftUI-ით. ნეტავ რამდენი ხანი გაგრძელდება Honeymoon phase?"),

]
